Revit 2027 API
ReferenceArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ReferenceArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As ReferenceArrayIterator
public:
virtual ReferenceArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> ReferenceArrayIterator
override ReverseIterator : unit -> ReferenceArrayIterator
Return Value
ReferenceArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
ReferenceArray Class
Autodesk.Revit.DB Namespace